Stable_Case_Upto_0p34s/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
111248
(
(150 0 0)
(150 0 0)
(150 0 0)
(150 0 0)
(150 0 0)
(150 0 0)
(150 0 0)
(150 0 0)
...
)
;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            pressureInletOutletVelocity;
        value           uniform (150 0 0);
    }
    SOLID_WALL
    {
        type            noSlip;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
