Stable_Case_Upto_0p34s/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
111248
(
5000000
5000000
5000000
5000000
5000000
5000000
5000000
5000000
...
)
;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 5000000;
    }
    SOLID_WALL
    {
        type            zeroGradient;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            fixedValue;
        value           uniform 101325;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 100000;
    }
}


// ************************************************************************* //
