Stable_Case_Upto_0p34s/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    model           kOmegaSST;
    turbulence      on;
    printCoeffs     on;

    kOmegaSSTCoeffs
    {
        a1          0.357;
        alphaK2     0.44;
        alphaOmega2 0.91;
    }
}
